---
kind: property
id: P:Autodesk.Revit.DB.Infrastructure.Alignment.StartStation
source: html/e3cf3a39-2fd0-f651-3366-f71a15fb5615.htm
---
# Autodesk.Revit.DB.Infrastructure.Alignment.StartStation Property

Specifies the station at which the alignment's geometric definition starts, in Revit internal model units (standard Imperial feet).

## Syntax (C#)
```csharp
public double StartStation { get; }
```

## Remarks
This station may be outside the displayed range ( DisplayedStartStation , DisplayedEndStation ).